# Ultralytics YOLOv8 Dual-Stream Object Detection Model
# For Visible + Infrared (RGB-T) Image Input
# Model architecture: Two-stream backbone with feature fusion

# Parameters
nc: 5  # number of classes
# reg_max 是YOLOv8中分布焦点损失 的参数，用于将边界框坐标回归转化为概率分布预测问题。
reg_max: 16  # DFL regression max channels (required for OBB head)
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Dual-Stream Backbone
# Stream 1: Visible (RGB) - Layers 0-9
# Stream 2: Infrared (Thermal) - Layers 10-19
# Fusion starts at layer 20
backbone:
  # [from, repeats, module, args]
  
  # ===== VISIBLE STREAM (RGB) =====
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (RGB input: 3 channels)
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9 (RGB features)
  
  # ===== INFRARED STREAM (Thermal) =====
  - [-1, 1, Conv, [64, 3, 2]] # 10-P1/2 (IR input: 3 channels)  
  - [-1, 1, Conv, [128, 3, 2]] # 11-P2/4
  - [-1, 3, C2f, [128, True]] # 12
  - [-1, 1, Conv, [256, 3, 2]] # 13-P3/8
  - [-1, 6, C2f, [256, True]] # 14
  - [-1, 1, Conv, [512, 3, 2]] # 15-P4/16
  - [-1, 6, C2f, [512, True]] # 16
  - [-1, 1, Conv, [1024, 3, 2]] # 17-P5/32
  - [-1, 3, C2f, [1024, True]] # 18
  - [-1, 1, SPPF, [1024, 5]] # 19 (IR features)
  
  # ===== FEATURE FUSION =====
  # Fuse features from low level (P3) to high level (P5)
  
  # Fusion at P3 level (smallest scale, highest resolution)
  - [[4, 14], 1, Concat, [1]] # 20 - Concat(P3_RGB, P3_IR)
  - [-1, 3, C2f, [256, True]] # 21 - Fused P3 features
  
  # Fusion at P4 level (medium scale)
  - [[6, 16], 1, Concat, [1]] # 22 - Concat(P4_RGB, P4_IR)
  - [-1, 3, C2f, [512, True]] # 23 - Fused P4 features
  
  # Fusion at P5 level (largest scale, lowest resolution)
  - [[9, 19], 1, Concat, [1]] # 24 - Concat(P5_RGB, P5_IR)
  - [-1, 3, C2f, [1024, True]] # 25 - Fused P5 features

# Dual-Stream Head with Fused Features
# Uses PAN-FPN structure with fused multi-scale features
head:
  # Top-down pathway (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 26 - Upsample fused P5
  - [[-1, 23], 1, Concat, [1]] # 27 - Concat with fused P4
  - [-1, 3, C2f, [512]] # 28
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 29 - Upsample
  - [[-1, 21], 1, Concat, [1]] # 30 - Concat with fused P3 (layer 21)
  - [-1, 3, C2f, [256]] # 31 (P3/8-small) - Final small scale features
  
  # Bottom-up pathway (PAN)
  - [-1, 1, Conv, [256, 3, 2]] # 32 - Downsample
  - [[-1, 28], 1, Concat, [1]] # 33 - Concat with P4
  - [-1, 3, C2f, [512]] # 34 (P4/16-medium) - Final medium scale features
  
  - [-1, 1, Conv, [512, 3, 2]] # 35 - Downsample
  - [[-1, 25], 1, Concat, [1]] # 36 - Concat with fused P5 (layer 25)
  - [-1, 3, C2f, [1024]] # 37 (P5/32-large) - Final large scale features
  
  # Detection head - receives 3 fused feature maps
  - [[31, 34, 37], 1, OBB, [nc, 1]] # OBB(P3, P4, P5) - reg_max from YAML config
