# Ultralytics YOLOv8 Dual-Stream Object Detection Model
# For Visible + Infrared (RGB-T) Image Input
# Model architecture: Two-stream backbone with FeatureFusionBlock

# Parameters
nc: 5  # number of classes
reg_max: 16  # DFL regression max channels (required for OBB head)
scale: s
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Dual-Stream Backbone
# Stream 1: Visible (RGB) - Layers 0-9
# Stream 2: Infrared (Thermal) - Layers 10-19
# Fusion: FeatureFusionBlock at layers 20-22
backbone:
  # [from, repeats, module, args]

  # ===== VISIBLE STREAM (RGB) =====
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (RGB input: 3 channels)
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9 (RGB features)

  # ===== INFRARED STREAM (Thermal) =====
  - [-1, 1, Conv, [64, 3, 2]] # 10-P1/2 (IR input: 3 channels)
  - [-1, 1, Conv, [128, 3, 2]] # 11-P2/4
  - [-1, 3, C2f, [128, True]] # 12
  - [-1, 1, Conv, [256, 3, 2]] # 13-P3/8
  - [-1, 6, C2f, [256, True]] # 14
  - [-1, 1, Conv, [512, 3, 2]] # 15-P4/16
  - [-1, 6, C2f, [512, True]] # 16
  - [-1, 1, Conv, [1024, 3, 2]] # 17-P5/32
  - [-1, 3, C2f, [1024, True]] # 18
  - [-1, 1, SPPF, [1024, 5]] # 19 (IR features)

  # ===== FEATURE FUSION =====
  # FeatureFusionBlock replaces Concat + C2f pairs.
  # Args: [output_channels, fusion_mode, attention]
  # c1 is auto-detected from ch[f[0]] (channels per stream).
  - [[4, 14], 1, FeatureFusionBlock, [256, "add", False]]  # 20 - P3 fusion
  - [[6, 16], 1, FeatureFusionBlock, [512, "add",False]]  # 21 - P4 fusion
  - [[9, 19], 1, FeatureFusionBlock, [1024, "add", False]] # 22 - P5 fusion

# Dual-Stream Head with Fused Features
# All layer indices shifted by -3 (3 C2f layers removed from backbone).
# Old refs: 23→21, 21→20, 28→25, 25→22, [31,34,37]→[28,31,34]
head:
  # Top-down pathway (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 23 - Upsample fused P5
  - [[-1, 21], 1, Concat, [1]] # 24 - Concat(upsampled P5, P4 fusion)
  - [-1, 3, C2f, [512]] # 25

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 26 - Upsample
  - [[-1, 20], 1, Concat, [1]] # 27 - Concat(upsampled, P3 fusion)
  - [-1, 3, C2f, [256]] # 28 (P3/8-small)

  # Bottom-up pathway (PAN)
  - [-1, 1, Conv, [256, 3, 2]] # 29 - Downsample
  - [[-1, 25], 1, Concat, [1]] # 30 - Concat(downsampled, layer 25)
  - [-1, 3, C2f, [512]] # 31 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 32 - Downsample
  - [[-1, 22], 1, Concat, [1]] # 33 - Concat(downsampled, P5 fusion)
  - [-1, 3, C2f, [1024]] # 34 (P5/32-large)

  # Detection head
  - [[28, 31, 34], 1, OBB, [nc, 1]] # 35 - OBB(P3, P4, P5)